<a href="https://colab.research.google.com/github/Aman2125/DataScience_CampusX_Practice/blob/main/6)aman_series_methods.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Some Important Series Method

In [1]:
#between
#clip
#drop_duplicates
#isnull
#dropna
#fillna
#isin
#apply
#copy

In [1]:
import numpy as np
import pandas as pd

In [2]:
subs = pd.read_csv('/content/subs.csv').squeeze()
subs.sample()

281    245
Name: Subscribers gained, dtype: int64

In [3]:
vk = pd.read_csv('/content/kohli_ipl.csv' , index_col='match_no').squeeze()
vk.sample()

match_no
123    108
Name: runs, dtype: int64

In [4]:
movies = pd.read_csv('/content/bollywood.csv' , index_col='movie').squeeze()
movies.sample()

movie
Children of Heaven    Mohammad Amir Naji
Name: lead, dtype: object

In [5]:
#between , tells if value exist in a range , output is boolean
vk[vk.between(51,99)].size

43

In [6]:
#clip , clip in a given range
subs.clip(100,200).head()

0    100
1    100
2    100
3    100
4    100
Name: Subscribers gained, dtype: int64

In [7]:
#drop_duplicates , remove the duplicates values
temp = pd.Series([1,1,2,2,2,3,4,4,5])
temp

0    1
1    1
2    2
3    2
4    2
5    3
6    4
7    4
8    5
dtype: int64

In [8]:
temp.drop_duplicates()

0    1
2    2
5    3
6    4
8    5
dtype: int64

In [9]:
temp = pd.Series([1,2,3,np.nan , 5,6,np.nan,8,np.nan,10])
temp

0     1.0
1     2.0
2     3.0
3     NaN
4     5.0
5     6.0
6     NaN
7     8.0
8     NaN
9    10.0
dtype: float64

In [10]:
temp.size

10

In [12]:
temp.count()

np.int64(7)

In [14]:
#isnull
temp.isnull().sum() #3 missing values

np.int64(3)

In [15]:
#dropna , drop the na values
temp.dropna()

0     1.0
1     2.0
2     3.0
4     5.0
5     6.0
7     8.0
9    10.0
dtype: float64

In [16]:
#fillna , replace the missing value with the given value eg 0 here
temp.fillna(0)

0     1.0
1     2.0
2     3.0
3     0.0
4     5.0
5     6.0
6     0.0
7     8.0
8     0.0
9    10.0
dtype: float64

In [17]:
#isin
vk.sample()

match_no
73    58
Name: runs, dtype: int64

In [18]:
vk[(vk == 49) | (vk == 99)] #49 and 99 run by vk

match_no
82    99
86    49
Name: runs, dtype: int64

In [19]:
vk[vk.isin([49,99])] #simple using isin function

match_no
82    99
86    49
Name: runs, dtype: int64

In [21]:
#apply
movies.apply(lambda x:x.split()[0].upper()).sample()

movie
Strangers (2007 Hindi film)    JIMMY
Name: lead, dtype: object

In [22]:
subs.mean()

np.float64(135.64383561643837)

In [24]:
#que is call a bad day if sub<135 in a day and good when sub>135
subs.apply(lambda x :'good day' if x >135 in subs else 'bad day').sample()

2    bad day
Name: Subscribers gained, dtype: object

In [35]:
#copy
new = vk.head().copy()
new

match_no
1    100
2     23
3     13
4     12
5      1
Name: runs, dtype: int64

In [34]:
new[1] = 1